In [113]:
import pandas as pd
import numpy as np
import datetime as dt

In [101]:
df_data = pd.DataFrame({'date':['3/10/2002', '10/2/2006', '10/10/2011', '21/3/2022'],
                        'value': [100, 232, 901, 189]})
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    4 non-null      object
 1   value   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [102]:
df_data.head()

         date  value
0   3/10/2002    100
1   10/2/2006    232
2  10/10/2011    901
3   21/3/2022    189

In [103]:
df_data['date'] = pd.to_datetime(df_data['date'], dayfirst=True)
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    4 non-null      datetime64[ns]
 1   value   4 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 192.0 bytes

In [104]:
df_data.head()

        date  value
0 2002-10-03    100
1 2006-02-10    232
2 2011-10-10    901
3 2022-03-21    189

In [105]:
df_data = pd.DataFrame({'date':['3-10-2002 20:34:01', '10-2-2006 23:09:08', '10-10-2011 12:00:13', '21-3-2022 17:36:57'],
                        'value': [100, 232, 901, 189]})
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    4 non-null      object
 1   value   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [106]:
df_data['date'] = pd.to_datetime(df_data['date']).dt.strftime('%d-%m-%Y %H:%M:%S')
df_data.head()

                  date  value
0  10-03-2002 20:34:01    100
1  02-10-2006 23:09:08    232
2  10-10-2011 12:00:13    901
3  21-03-2022 17:36:57    189

In [107]:
df_data = pd.DataFrame({'year': [2022, 2019],
                        'month': [2, 5],
                        'day': [12, 17]})
df_data.head()

   year  month  day
0  2022      2   12
1  2019      5   17

In [108]:
df_data['date'] = pd.to_datetime(df_data)
df_data.head()

   year  month  day       date
0  2022      2   12 2022-02-12
1  2019      5   17 2019-05-17

In [114]:
df_data = pd.DataFrame({'name': ['Hoang', 'Su', 'Duong', 'Phuong'],
                       'DOB': ['12-11-1979', '21-3-1989', '23-01-1996', '14-05-1995']})
df_data.head()

     name         DOB
0   Hoang  12-11-1979
1      Su   21-3-1989
2   Duong  23-01-1996
3  Phuong  14-05-1995

Covert to datetime

In [119]:
df_data['DOB'] = pd.to_datetime(df_data['DOB']).dt.strftime('%Y-%m-%d %H:%M:%S')
df_data.head()

     name                  DOB
0   Hoang  1979-12-11 00:00:00
1      Su  1989-03-21 00:00:00
2   Duong  1996-01-23 00:00:00
3  Phuong  1995-05-14 00:00:00

Get year, month, day, week, day of week

In [131]:
df_data['Year'] = pd.DatetimeIndex(df_data['DOB']).year
df_data['Month'] = pd.to_datetime(df_data['DOB']).dt.strftime('%m')
df_data['Day'] = pd.to_datetime(df_data['DOB']).dt.strftime('%d')
df_data['Week'] = pd.to_datetime(df_data['DOB']).dt.strftime('%U')
df_data['DOW'] = pd.to_datetime(df_data['DOB']).dt.strftime('%A')
df_data.head()

     name                  DOB  Year Month Day Week      DOW  now_year
0   Hoang  1979-12-11 00:00:00  1979    12  11   49  Tuesday      2022
1      Su  1989-03-21 00:00:00  1989    03  21   12  Tuesday      2022
2   Duong  1996-01-23 00:00:00  1996    01  23   03  Tuesday      2022
3  Phuong  1995-05-14 00:00:00  1995    05  14   20   Sunday      2022

Get age from DOB and store in a new column named Age

In [132]:
now = pd.datetime.now()
df_data['now_year'] = pd.datetime.now().year
df_data['Age'] = df_data['now_year'] - df_data['Year']
df_data.head()

C:\Users\Enoza\AppData\Local\Temp\ipykernel_2860\1520258969.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  now = pd.datetime.now()
C:\Users\Enoza\AppData\Local\Temp\ipykernel_2860\1520258969.py:2: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  df_data['now_year'] = pd.datetime.now().year

     name                  DOB  Year Month Day Week      DOW  now_year  Age
0   Hoang  1979-12-11 00:00:00  1979    12  11   49  Tuesday      2022   43
1      Su  1989-03-21 00:00:00  1989    03  21   12  Tuesday      2022   33
2   Duong  1996-01-23 00:00:00  1996    01  23   03  Tuesday      2022   26
3  Phuong  1995-05-14 00:00:00  1995    05  14   20   Sunday      2022   27